Polish readme.md
